Catalogs/Услуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Услуги</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальнаяСтоимостьДляПартнера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремениНаВыполнение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтвественныйЗаВыполнение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаРасхода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Материалы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Материалы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Характеристики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдИзм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальноеКоличествоНаСкладе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакупочнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Услуги/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура МатериалыМатериалПриИзменении(Элемент)
	Материал = Элементы.Материалы.ТекущиеДанные.Материал;  	Элементы.Материалы.ТекущиеДанные.ЕдИзм = получед(Материал).ЕдИзм;
	Элементы.Материалы.ТекущиеДанные.Стоимость = получед(Материал).Себестоимость;      	
КонецПроцедуры     

функция получед(материал)  Запрос = Новый Запрос;  Запрос.Текст =     "ВЫБРАТЬ ПЕРВЫЕ 1    |  Материалы.Ссылка КАК Ссылка,    |  Материалы.ЕдИзм КАК ЕдИзм, 
	|  Материалы.ЗакупочнаяСтоимость КАК ЗакСтоимость    |ИЗ    |  Справочник.Материалы КАК Материалы    |ГДЕ    |  Материалы.Ссылка = &Ссылка";  Запрос.УстановитьПараметр("Ссылка",материал);    РезультатЗапроса = Запрос.Выполнить();    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
  
  Вернуть = Новый Структура;    Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	  Вернуть.Вставить("ЕдИзм", ВыборкаДетальныеЗаписи.ЕдИзм); 
	  Вернуть.Вставить("Себестоимость", ВыборкаДетальныеЗаписи.ЗакСтоимость);  	Возврат Вернуть;  Иначе     Возврат Неопределено;  КонецЕсли;конецФункции

&НаКлиенте
Процедура МатериалыНормаРасходаПриИзменении(Элемент)
	ТекСтрока = Элементы.Материалы.ТекущиеДанные;
	Если ТекСтрока.НормаРасхода <> 0 Тогда
		ТекСтрока.Сумма = ТекСтрока.НормаРасхода * ТекСтрока.Стоимость;
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры 

Функция ОбновитьСебестоимостьУслуги()  
	Часы = Объект.НормаВремениНаВыполнение;
	ОкладВЧасСотрудника = Объект.ОтвественныйЗаВыполнение.Должность.Оклад;   
	СуммаМатериалов = 0;
	Для каждого стр Из Объект.Материалы Цикл  
		Если стр.Сумма <> Неопределено Тогда
			СуммаМатериалов = СуммаМатериалов + стр.Сумма;
		КонецЕсли;
	КонецЦикла;
	Себестоимость = Часы * ОкладВЧасСотрудника + СуммаМатериалов;    
	Если Себестоимость <> Неопределено ИЛИ Себестоимость <> 0 Тогда
		Возврат Себестоимость;  
	Иначе
		Возврат 0;  
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура НормаВремениНаВыполнениеПриИзменении(Элемент)
	Себестоимость = ОбновитьСебестоимостьУслуги(); 
	Объект.Себестоимость = Себестоимость;   
	Объект.МинимальнаяСтоимостьДляПартнера = Себестоимость + Себестоимость / 100 * 15;
КонецПроцедуры


&НаКлиенте
Процедура ОтвественныйЗаВыполнениеПриИзменении(Элемент)
	Себестоимость = ОбновитьСебестоимостьУслуги(); 
	Объект.Себестоимость = Себестоимость;   
	Объект.МинимальнаяСтоимостьДляПартнера = Себестоимость + Себестоимость / 100 * 15;
КонецПроцедуры


&НаКлиенте
Процедура МатериалыПриИзменении(Элемент)
	Себестоимость = ОбновитьСебестоимостьУслуги(); 
	Объект.Себестоимость = Себестоимость;   
	Объект.МинимальнаяСтоимостьДляПартнера = Себестоимость + Себестоимость / 100 * 15;
КонецПроцедуры
